package homeTask.homeTask13;

/**
 Написать статический метод cube, который возвращает куб переданного числа.
 */
public class homeTask13_3 {

    public static void main(String[] args) {

        System.out.println(cube(2));
    }
    private static double cube(double i)
    {
        return i*i*i;
    }
}
