package homeTask.homeTask13;

import java.util.Scanner;

/**
 Написать статический метод myRound для округления заданного числа до указанного количества знаков после запятой.
 Метод возвращает полученное число.
 */
public class homeTask13_11 {

    /*public static void main(String[] arg){
        Scanner scanner = new Scanner(System.in);
        //System.out.println("Введите число: ");
        //int num = scanner.nextInt();
        double num = 23332222.2323222222;
        //System.out.println("Укажите кол-во знаков округления: ");
        //int charNum = scanner.nextInt();
        int charNum = 3;
        scanner.close();

        System.out.println("Число после округления: " + myRound(num, charNum));

    }
    private static double myRound(double num, int charNum) {
        return Math.round(num * Math.pow(10, charNum)) / Math.pow(10, charNum);
    }*/
}
