package homeTask.homeTask12;

/**
 /**
 Написать программу, которая представляет собой простую версию базы данных по хранению логинов-паролей. Возможности программы:
 1) добавление пользователя (с клавиатуры указывается логин и пароль). Если такого логина
 ещё нет в базе, тогда в массив добавляется новый пользователь (при этом в отдельном
 массиве типа DateTime фиксируется время создания пользователя).
 2) редактирование паролей (с клавиатуры указывается логин для нужного пользователя).
 3) удаление пользователя (по номеру в массиве, начиная с 0).
 4) показ всех данных (список всех пользователей - логины и время регистрации).
 */
public class homeTask12_25 {

    /*public static void main(String[] args)
    {
        ArrayList<String> listAccount = new ArrayList<String>();
        System.out.println("HI! Please select: \n1) New account \n2)Change password \n3) Delete account \n4) List of accounts");
        Scanner scanner = new Scanner(System.in);
        int sc = scanner.nextInt();
        switch (sc)
        {
            case 1:

                //listAccount.add(String login, String pass, String time);
                addAccount();
                break;
            case 2:
                editpassword();
                break;
            case 3:
                deleteAccount();
                break;
            case 4:
                Account();
                break;
            default:
                System.out.println("\nInvalid Selection");
        }

        //String login = scanner.nextLine();

        //if (login != Account(String name)) {
        //    Account.class = new
        //}
    }

    public Account(String login, String pass, String time)
    {
        this.login = data[0];
        this.pass = data[1];
        this.time = Integer.parseInt(data[2]);

        /*String name[] = new String[];
        String pass = new String[];
        double time = new double[];

        public Account(String[] name)
        {
            this.name = [i];
        }
        public Account(String[] pass)
        {
            this.pass =
        }
    }
    private void accountList(name, pass, time) {
        name =
    }
    String name = "";
    String pass = "";
    double time;*/
}
